# Розробити структуру для зберігання інформації для відображення
# списку справ із прив’язкою до дат. Враховуйте, що до однієї
# дати можуть відноситись одразу декілька справ.
# Спробуйте погратися із цим списком - програмно додайте нову справу або видаліть її.
# Програмно спробуйте видалити усі справи за обрану дату.


# M_dela1 = ["пойти в магазин за одеждой", "Купить порошок для стирки", "Платить по считам"]
# M_dela2 = ["Решить пару задач по пайтону", "Купить арбуз", "Поспать больше 2-х часов"] # стандартный способ, наеврное, работает нормально

# if day == "monday":
#      print(M_dela1)
# elif day == "tuesday":
#      print(M_dela2)
#        # f = input()
#        # M_dela2.append(f)
#        # if M_dela2 == 0:
#        #      M_dela2.remove(2) \\ не знаю как задать значение, что бы удалял конкретный элемент
#        # print(M_dela2)
# elif day == "wednesday":
#      print(M_dela3)
# elif day == "thursday":
#      print(M_dela4)
# else:
#      day = "friday"
#      print(M_dela5)


dela_1 = {
    "2020-02-21": {
          'AM': ["Купить пиво", "купить рыбки", "наслаждаться жизнью"],
          'PM': ["Продать рыбку", "продать пиво", "идти на завод"]
    },
    "2020-02-22": {
          "AM": ["Пойти на работу", "написать код", "попить кофе"],
          "PM": ["Покушоть", "Пойти домой", "поспать"]
     }
}
print(dela_1)

day = input("Выберите день ")
if day == '2020-02-21':
     print(dela_1['2020-02-21'][input()]) # ввводим AM или PM и получаем список
     del dela_1['2020-02-21'][input()][int(input())] # вводим опять АМ или РМ , пишем цыфру по нумерацие списка и значение удаляеться
     print(dela_1['2020-02-21'][input()]) # ввводим AM или PM и получаем список
     dela_1['2020-02-21'][input()] = input() # добавляем в список какое-то предложение
     print(dela_1['2020-02-21'][input()]) # ввводим AM или PM и получаем список
elif day == '2020-02-22':
    print(dela_1['2020-02-22'][input()])
    del dela_1['2020-02-22'][input()][int(input())]
    print(dela_1['2020-02-22'][input()])
    dela_1['2020-02-22'][input()] = input()
    print(dela_1['2020-02-22'][input()])
else:
    print("Не точные данные")




